import "./Home.css"

function Home() {
    return (
        <div id="home-page">
            <h1>מה זה Ivrit?</h1>
            <p>
                אחד המחסומים העיקריים בלמידת תכנות בישראל הוא השימוש באנגלית. כיוון ששפות התכנות עצמן הן באנגלית, והתיעוד שלהן כתוב גם הוא באנגלית, רבים מהלומדים נאלצים לוותר כבר בשלבי הלמידה הראשונים. כדי להתמודד עם הבעיה הזו,יצרתי את שפת Ivrit! <br />
                Ivrit היא שפת תכנות שכולה בעברית, והיא תוכננה במיוחד כך שכולם יוכלו ללמוד אותה ולהשתמש בה, אפילו ללא ניסיון קודם בתכנות. <br/>
            </p>

            <p className="m-0">
                השפה מכילה את כל הדברים הבסיסיים שיש בשפות תכנות מוכרות:
            </p>
            <ul>
                <li>משתנים</li>
                <li>תנאים ולולאות</li>
                <li>קלט\פלט</li>
                <li>פונקציות ורקורסיה</li>
            </ul>
            
            <p>תוכניות בשפה אפשר להריץ או באתר הזה- בעמוד העורך, או באמצעות תוכנה שניתן להוריד למחשב ישירות.</p>

            <h1>איך מתחילים?</h1>
            <p>
                עבור מי שזו שפת התכנות הראשונה שלו, מומלץ להתחיל בעמוד המדריך. הוא מלמד איך לתכנת בשפה מאפס- בדיוק בשביל אלו ללא ניסיון קודם בתכנות. <br />
               מי שכבר מנוסה בתכנות כנראה יעדיף לעבור על עמוד התיעוד, בו מפורט על תחביר השפה. <br /> <br />
                בשני המקרים, מומלץ קודם להשתמש בעורך שבאתר, ורק לאחר שמתנסים איתו כדאי לשקול להוריד את כלי הפירוש שבעמוד ההורדה בשביל להריץ תוכניות ישירות על המחשב שלכם.
            </p>

        </div>
    )
}

export default Home